CSI API ETABS v1
cFile.ImportFile Method
 Imports the model file to the application.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ImportFile(
	string FileName,
	eFileTypeIO FileType,
	int Type
)
Function ImportFile (
	FileName As String,
	FileType As eFileTypeIO,
	Type As Integer
) As Integer
Dim instance As cFile
Dim FileName As String
Dim FileType As eFileTypeIO
Dim Type As Integer
Dim returnValue As Integer
returnValue = instance.ImportFile(FileName,
	FileType, Type)
int ImportFile(
	String^ FileName,
	eFileTypeIO FileType,
	int Type
)
abstract ImportFile :
        FileName : string *
        FileType : eFileTypeIO *
        Type : int -> int
Parameters
FileName
Type: System.String
The full path of a model file to be opened in the application.
FileType
Type: ETABSv1.eFileTypeIO
 This is an item from the eFileTypeIO enumeration.
TextFile
DBTablesExcel
DBTablesAccess
DBTablesText
DBTablesXML
Type
Type: System.Int32
 This is an integer between 1 and 2 indicating the type of importing
1 = New Model
2 = Add to Existing Model
Return Value
Type: Int32
 Returns zero if the file is successfully opened and nonzero if it is not opened.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim FileName as String
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'Create steel deck template model
       ret = mySapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
       Dim FileName As String
       Dim FileType As eFileTypeIO
       FileName = "c:\CSI_API_temp\example.e2k"
       FileType = eFileTypeIO.DBTablesExcel
       Type = 1
       ret = SapModel.File.ExportFile(FileName, FileType)
       ret = SapModel.File.ImportFile(FileName, FileType, Type)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cFile Interface
ETABSv1 Namespace